{
  "backend/main.mo": "Motoko canister managing user profiles and member/cafe access with permission checks for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping product features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend components and styling files.",
  "frontend/index.css": "Tailwind base stylesheet defining global OKLCH color tokens and light/dark theme variables for the site.",
  "frontend/index.html": "Minimal HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling navigation between home, account, and access‑pass views.",
  "frontend/src/components/account/AccountSection.tsx": "Account page showing membership status, Tonic access, and profile state with login and loading handling.",
  "frontend/src/components/account/ProfileSetupDialog.tsx": "Modal dialog for first‑time users to enter and save their name as a profile.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button managing authentication state and query cache clearing.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying branding, current year, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation buttons, login button, and mobile menu toggle.",
  "frontend/src/components/marketing/Hero.tsx": "Marketing hero section with logo, title, description, and a large facility image.",
  "frontend/src/components/marketing/HolisticSection.tsx": "Displays three fitness principles with icons and descriptions in a grid layout.",
  "frontend/src/components/marketing/Section.tsx": "Wrapper component providing consistent section padding and container layout.",
  "frontend/src/components/marketing/TonicCafeSection.tsx": "Showcases Tonic Cafe features and a members-only benefit using icons and styled cards.",
  "frontend/src/components/marketing/WorkoutStyles.tsx": "Lists workout types with icons and descriptions in a responsive grid.",
  "frontend/src/components/pass/TonicAccessPass.tsx": "Renders a digital Tonic access pass based on authentication, user profile, and membership state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and helpers using Internet Identity, managing login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and updating caller user profiles and membership state through the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables for light/dark themes, and global typography and layout styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, importing global CSS and rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, and clear URL and session parameters, with support for hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including OKLCH color tokens, typography, container settings, animations, and plugins.",
  "project_state.json": "Holds metadata about project state, features, requirements, and planned assets for the Gym & Tonic app."
}